zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f470i(g-i-k)xx-pinctrl.h
/* SPI1_NSS */
#define SPI1_NSS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)
#define SPI1_NSS_PD1 \
	GD32_PINMUX_AF('D', 1, AF7)
#define SPI1_NSS_PI0 \
	GD32_PINMUX_AF('I', 0, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define SPI1_SCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define SPI1_SCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF5)
#define SPI1_SCK_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)
#define SPI1_SCK_PI1 \
	GD32_PINMUX_AF('I', 1, AF5)

/* SPI2_MISO */
#define SPI2_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)
#define SPI2_MISO_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)

/* SPI2_MOSI */
#define SPI2_MOSI_PB0 \
	GD32_PINMUX_AF('B', 0, AF7)
#define SPI2_MOSI_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define SPI2_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define SPI2_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define SPI2_MOSI_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)
#define SPI2_MOSI_PD0 \
	GD32_PINMUX_AF('D', 0, AF6)
#define SPI2_MOSI_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)

/* SPI2_NSS */
#define SPI2_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define SPI2_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* SPI2_SCK */
#define SPI2_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define SPI2_SCK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* SPI3_MISO */
#define SPI3_MISO_PA11 \
	GD32_PINMUX_AF('A', 11, AF6)
#define SPI3_MISO_PD0 \
	GD32_PINMUX_AF('D', 0, AF5)
#define SPI3_MISO_PE5 \
	GD32_PINMUX_AF('E', 5, AF5)
#define SPI3_MISO_PE13 \
	GD32_PINMUX_AF('E', 13, AF5)
#define SPI3_MISO_PG12 \
	GD32_PINMUX_AF('G', 12, AF6)

/* SPI3_MOSI */
#define SPI3_MOSI_PA1 \
	GD32_PINMUX_AF('A', 1, AF5)
#define SPI3_MOSI_PE6 \
	GD32_PINMUX_AF('E', 6, AF5)
#define SPI3_MOSI_PE14 \
	GD32_PINMUX_AF('E', 14, AF5)
#define SPI3_MOSI_PG13 \
	GD32_PINMUX_AF('G', 13, AF6)

/* SPI3_NSS */
#define SPI3_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF6)
#define SPI3_NSS_PE4 \
	GD32_PINMUX_AF('E', 4, AF5)
#define SPI3_NSS_PE11 \
	GD32_PINMUX_AF('E', 11, AF5)
#define SPI3_NSS_PG14 \
	GD32_PINMUX_AF('G', 14, AF6)

/* SPI3_SCK */
#define SPI3_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF6)
#define SPI3_SCK_PE2 \
	GD32_PINMUX_AF('E', 2, AF5)
#define SPI3_SCK_PE12 \
	GD32_PINMUX_AF('E', 12, AF5)
#define SPI3_SCK_PG11 \
	GD32_PINMUX_AF('G', 11, AF6)

/* SPI4_MISO */
#define SPI4_MISO_PA12 \
	GD32_PINMUX_AF('A', 12, AF6)
#define SPI4_MISO_PE13 \
	GD32_PINMUX_AF('E', 13, AF6)
#define SPI4_MISO_PF8 \
	GD32_PINMUX_AF('F', 8, AF5)
#define SPI4_MISO_PH7 \
	GD32_PINMUX_AF('H', 7, AF5)

/* SPI4_MOSI */
#define SPI4_MOSI_PA10 \
	GD32_PINMUX_AF('A', 10, AF6)
#define SPI4_MOSI_PB8 \
	GD32_PINMUX_AF('B', 8, AF6)
#define SPI4_MOSI_PE14 \
	GD32_PINMUX_AF('E', 14, AF6)
#define SPI4_MOSI_PF9 \
	GD32_PINMUX_AF('F', 9, AF5)
#define SPI4_MOSI_PF11 \
	GD32_PINMUX_AF('F', 11, AF5)

/* SPI4_NSS */
#define SPI4_NSS_PB1 \
	GD32_PINMUX_AF('B', 1, AF6)
#define SPI4_NSS_PE11 \
	GD32_PINMUX_AF('E', 11, AF6)
#define SPI4_NSS_PF6 \
	GD32_PINMUX_AF('F', 6, AF5)
#define SPI4_NSS_PH5 \
	GD32_PINMUX_AF('H', 5, AF5)

/* SPI4_SCK */
#define SPI4_SCK_PB0 \
	GD32_PINMUX_AF('B', 0, AF6)
#define SPI4_SCK_PE12 \
	GD32_PINMUX_AF('E', 12, AF6)
#define SPI4_SCK_PF7 \
	GD32_PINMUX_AF('F', 7, AF5)
#define SPI4_SCK_PH6 \
	GD32_PINMUX_AF('H', 6, AF5)

/* SPI5_IO2 */
#define SPI5_IO2_PG10 \
	GD32_PINMUX_AF('G', 10, AF5)

/* SPI5_IO3 */
#define SPI5_IO3_PG11 \
	GD32_PINMUX_AF('G', 11, AF5)

/* SPI5_MISO */
#define SPI5_MISO_PG12 \
	GD32_PINMUX_AF('G', 12, AF5)

/* SPI5_MOSI */
#define SPI5_MOSI_PG14 \
	GD32_PINMUX_AF('G', 14, AF5)

/* SPI5_NSS */
#define SPI5_NSS_PG8 \
	GD32_PINMUX_AF('G', 8, AF5)

/* SPI5_SCK */
#define SPI5_SCK_PG13 \
	GD32_PINMUX_AF('G', 13, AF5)

/* SWCLK */
#define SWCLK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TIMER0_BRKIN_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)
#define TIMER0_BRKIN_PE15 \
	GD32_PINMUX_AF('E', 15, AF1)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)
#define TIMER0_CH0_PE9 \
	GD32_PINMUX_AF('E', 9, AF1)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER0_CH0_ON_PB13 \
	GD32_PINMUX_AF('B', 13, AF1)
#define TIMER0_CH0_ON_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)
#define TIMER0_CH1_PE11 \
	GD32_PINMUX_AF('E', 11, AF1)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TIMER0_CH1_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TIMER0_CH1_ON_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)
#define TIMER0_CH1_ON_PE1 \
	GD32_PINMUX_AF('E', 1, AF1)
#define TIMER0_CH1_ON_PE10 \
	GD32_PINMUX_AF('E', 10, AF1)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TIMER0_CH2_PE13 \
	GD32_PINMUX_AF('E', 13, AF1)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB15 \
	GD32_PINMUX_AF('B', 15, AF1)
#define TIMER0_CH2_ON_PE12 \
	GD32_PINMUX_AF('E', 12, AF1)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11 \
	GD32_PINMUX_AF('A', 11, AF1)
#define TIMER0_CH3_PE14 \
	GD32_PINMUX_AF('E', 14, AF1)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12 \
	GD32_PINMUX_AF('A', 12, AF1)
#define TIMER0_ETI_PE7 \
	GD32_PINMUX_AF('E', 7, AF1)

/* TIMER10_CH0 */
#define TIMER10_CH0_PB9 \
	GD32_PINMUX_AF('B', 9, AF3)
#define TIMER10_CH0_PF7 \
	GD32_PINMUX_AF('F', 7, AF3)

/* TIMER11_CH0 */
#define TIMER11_CH0_PB14 \
	GD32_PINMUX_AF('B', 14, AF9)
#define TIMER11_CH0_PH6 \
	GD32_PINMUX_AF('H', 6, AF9)

/* TIMER11_CH1 */
#define TIMER11_CH1_PB15 \
	GD32_PINMUX_AF('B', 15, AF9)
#define TIMER11_CH1_PH9 \
	GD32_PINMUX_AF('H', 9, AF9)

/* TIMER12_CH0 */
#define TIMER12_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF9)
#define TIMER12_CH0_PF8 \
	GD32_PINMUX_AF('F', 8, AF9)

/* TIMER13_CH0 */
#define TIMER13_CH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF9)
#define TIMER13_CH0_PF9 \
	GD32_PINMUX_AF('F', 9, AF9)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)
#define TIMER1_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)
#define TIMER1_CH1_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)

