zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f470i(g-i-k)xx-pinctrl.h
/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PB2 \
	GD32_PINMUX_AF('B', 2, AF1)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)
#define TIMER1_ETI_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER2_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF2)

/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AF('D', 2, AF2)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)
#define TIMER3_CH0_PD12 \
	GD32_PINMUX_AF('D', 12, AF2)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)
#define TIMER3_CH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)
#define TIMER3_CH2_PD14 \
	GD32_PINMUX_AF('D', 14, AF2)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)
#define TIMER3_CH3_PD15 \
	GD32_PINMUX_AF('D', 15, AF2)

/* TIMER3_ETI */
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AF('E', 0, AF2)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER4_CH0_PH10 \
	GD32_PINMUX_AF('H', 10, AF2)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)
#define TIMER4_CH1_PH11 \
	GD32_PINMUX_AF('H', 11, AF2)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER4_CH2_PH12 \
	GD32_PINMUX_AF('H', 12, AF2)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)
#define TIMER4_CH3_PI0 \
	GD32_PINMUX_AF('I', 0, AF2)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)
#define TIMER7_BRKIN_PI4 \
	GD32_PINMUX_AF('I', 4, AF3)

/* TIMER7_CH0 */
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)
#define TIMER7_CH0_PI5 \
	GD32_PINMUX_AF('I', 5, AF3)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER7_CH0_ON_PH13 \
	GD32_PINMUX_AF('H', 13, AF3)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)
#define TIMER7_CH1_PI6 \
	GD32_PINMUX_AF('I', 6, AF3)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)
#define TIMER7_CH1_ON_PB14 \
	GD32_PINMUX_AF('B', 14, AF3)
#define TIMER7_CH1_ON_PH14 \
	GD32_PINMUX_AF('H', 14, AF3)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF3)
#define TIMER7_CH2_PI7 \
	GD32_PINMUX_AF('I', 7, AF3)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER7_CH2_ON_PB15 \
	GD32_PINMUX_AF('B', 15, AF3)
#define TIMER7_CH2_ON_PH15 \
	GD32_PINMUX_AF('H', 15, AF3)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF3)
#define TIMER7_CH3_PI2 \
	GD32_PINMUX_AF('I', 2, AF3)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF3)
#define TIMER7_ETI_PI3 \
	GD32_PINMUX_AF('I', 3, AF3)

/* TIMER8_CH0 */
#define TIMER8_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF3)
#define TIMER8_CH0_PE5 \
	GD32_PINMUX_AF('E', 5, AF3)

/* TIMER8_CH1 */
#define TIMER8_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF3)
#define TIMER8_CH1_PE6 \
	GD32_PINMUX_AF('E', 6, AF3)

/* TIMER9_CH0 */
#define TIMER9_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF3)
#define TIMER9_CH0_PF6 \
	GD32_PINMUX_AF('F', 6, AF3)

/* TLI_B0 */
#define TLI_B0_PE4 \
	GD32_PINMUX_AF('E', 4, AF14)

/* TLI_B1 */
#define TLI_B1_PG12 \
	GD32_PINMUX_AF('G', 12, AF14)

/* TLI_B2 */
#define TLI_B2_PD6 \
	GD32_PINMUX_AF('D', 6, AF14)

/* TLI_B3 */
#define TLI_B3_PD10 \
	GD32_PINMUX_AF('D', 10, AF14)
#define TLI_B3_PG11 \
	GD32_PINMUX_AF('G', 11, AF14)

/* TLI_B4 */
#define TLI_B4_PE12 \
	GD32_PINMUX_AF('E', 12, AF14)
#define TLI_B4_PG12 \
	GD32_PINMUX_AF('G', 12, AF9)
#define TLI_B4_PI4 \
	GD32_PINMUX_AF('I', 4, AF14)

/* TLI_B5 */
#define TLI_B5_PA3 \
	GD32_PINMUX_AF('A', 3, AF14)
#define TLI_B5_PI5 \
	GD32_PINMUX_AF('I', 5, AF14)

/* TLI_B6 */
#define TLI_B6_PB8 \
	GD32_PINMUX_AF('B', 8, AF14)
#define TLI_B6_PI6 \
	GD32_PINMUX_AF('I', 6, AF14)

/* TLI_B7 */
#define TLI_B7_PB9 \
	GD32_PINMUX_AF('B', 9, AF14)
#define TLI_B7_PI7 \
	GD32_PINMUX_AF('I', 7, AF14)

/* TLI_DE */
#define TLI_DE_PE13 \
	GD32_PINMUX_AF('E', 13, AF14)
#define TLI_DE_PF10 \
	GD32_PINMUX_AF('F', 10, AF14)

/* TLI_G0 */
#define TLI_G0_PE5 \
	GD32_PINMUX_AF('E', 5, AF14)

/* TLI_G1 */
#define TLI_G1_PE6 \
	GD32_PINMUX_AF('E', 6, AF14)

/* TLI_G2 */
#define TLI_G2_PA6 \
	GD32_PINMUX_AF('A', 6, AF14)
#define TLI_G2_PH13 \
	GD32_PINMUX_AF('H', 13, AF14)

/* TLI_G3 */
#define TLI_G3_PE11 \
	GD32_PINMUX_AF('E', 11, AF14)
#define TLI_G3_PG10 \
	GD32_PINMUX_AF('G', 10, AF9)
#define TLI_G3_PH14 \
	GD32_PINMUX_AF('H', 14, AF14)

/* TLI_G4 */
#define TLI_G4_PB10 \
	GD32_PINMUX_AF('B', 10, AF14)
#define TLI_G4_PH15 \
	GD32_PINMUX_AF('H', 15, AF14)

/* TLI_G5 */
#define TLI_G5_PB11 \
	GD32_PINMUX_AF('B', 11, AF14)
#define TLI_G5_PI0 \
	GD32_PINMUX_AF('I', 0, AF14)

/* TLI_G6 */
#define TLI_G6_PC7 \
	GD32_PINMUX_AF('C', 7, AF14)
#define TLI_G6_PI1 \
	GD32_PINMUX_AF('I', 1, AF14)

/* TLI_G7 */
#define TLI_G7_PD3 \
	GD32_PINMUX_AF('D', 3, AF14)
#define TLI_G7_PI2 \
	GD32_PINMUX_AF('I', 2, AF14)

/* TLI_HSYNC */
#define TLI_HSYNC_PC6 \
	GD32_PINMUX_AF('C', 6, AF14)
#define TLI_HSYNC_PI10 \
	GD32_PINMUX_AF('I', 10, AF14)

